1) Libraries & Toolkits

In [34]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

2) Importing Dataset and exploration

In [35]:
df = pd.read_csv('merged_cars.csv')

# data shapes 
print("cars data shape : " , str(df.shape))

# old data shapes 
print("old cars data shape : " , str(df[df['new'] == 0].shape))

# new data shapes
print("new cars data shape : " , str(df[df['new'] == 1].shape))

df.head()

cars data shape :  (31900, 12)
old cars data shape :  (14741, 12)
new cars data shape :  (17159, 12)

,Brand,Model,Body,Color,Year,Fuel,Kilometers,Engine,Trasmission,Price,Gov,new
0,Hyundai,Accent,Sedan,Black,2007.0,Benzine,140000 to 159999,1600 CC,Automatic,140.0,Giza,0
1,Hyundai,Accent,Sedan,Silver,2005.0,Benzine,180000 to 199999,1000 - 1300 CC,Manual,78.0,Qena,0
2,Hyundai,Accent,Sedan,Gray,1999.0,Benzine,140000 to 159999,1400 - 1500 CC,Manual,70.0,Giza,0
3,Hyundai,Accent,Sedan,Blue- Navy Blue,2009.0,Benzine,140000 to 159999,1600 CC,Automatic,150.0,Cairo,0
4,Hyundai,Accent,Sedan,Silver,2000.0,Benzine,10000 to 19999,1000 - 1300 CC,Manual,75.0,Giza,0

In [36]:
df.info()

# columns ['Body' , 'Year' , 'Engine' ] have null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31900 entries, 0 to 31899
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Brand        31900 non-null  object
 1   Model        31900 non-null  object
 2   Body         14741 non-null  object
 3   Color        31900 non-null  object
 4   Year         31898 non-null  float64
 5   Fuel         31900 non-null  object
 6   Kilometers   31900 non-null  object
 7   Engine       14741 non-null  object
 8   Trasmission  31900 non-null  object
 9   Price        31900 non-null  object
 10  Gov          31900 non-null  object
 11  new          31900 non-null  int64
dtypes: float64(1), int64(1), object(10)
memory usage: 2.9+ MB

In [37]:
df[df['Year'].isnull()].head()

,Brand,Model,Body,Color,Year,Fuel,Kilometers,Engine,Trasmission,Price,Gov,new
16602,Hyundai,Accent,NaN,Silver,NaN,diesel,"138,000 Km",NaN,manual,0 EGP,El Haram,1
26885,Volkswagen,Beetle,NaN,Red,NaN,gas,0 Km,NaN,manual,"60,000 EGP",Cairo,1

In [38]:
pd.DataFrame({'': df.columns , 'Number of unique values':  df.nunique().values})
# Number of uniques values in Data

                 Number of unique values
0         Brand                       94
1         Model                      828
2          Body                        3
3         Color                       27
4          Year                       58
5          Fuel                        7
6    Kilometers                      934
7        Engine                        3
8   Trasmission                        5
9         Price                     1347
10          Gov                      108
11          new                        2

In [39]:
df.Brand.value_counts()

Hyundai               7495
Fiat                  6167
Chevrolet             5312
Nissan                1131
Kia                   1090
                      ...
Canghe  || Changhe       1
Pontiac                  1
Aston Martin             1
Kaiyi                    1
Perodua                  1
Name: Brand, Length: 94, dtype: int64

3) Data Cleaning

In [49]:
# we can notice that fuel types doesn't make sense due to merged data 
# get the unique values of fuel type
print(df['Fuel'].unique())

# gas and Benzine are the same
df['Fuel'] = df['Fuel'].replace('gas' , 'Benzine')

# diesl and Natural/natural Gas are the same
df['Fuel'] = df['Fuel'].replace('diesel' , 'Natural Gas')
df['Fuel'] = df['Fuel'].replace('natural gas' ,  'Natural Gas')

# get the unique values of fuel type
print(df['Fuel'].unique())

# get data unique info

pd.DataFrame({'': df.columns , 'Number of unique values':  df.nunique().values})
# Number of uniques values in Data

['Benzine' 'Natural Gas' 'Electric' 'Hybrid']
['Benzine' 'Natural Gas' 'Electric' 'Hybrid']

                 Number of unique values
0         Brand                       94
1         Model                      828
2          Body                        3
3         Color                       27
4          Year                       58
5          Fuel                        4
6    Kilometers                      934
7        Engine                        3
8   Trasmission                        5
9         Price                     1347
10          Gov                      108
11          new                        2